results/case_lale_20260806_084558/config/system/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Script: generate_cmesh.py                       |
|   \  /    A nd           | Time: 2026-08-04 18:36:33.037534                |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
	(-9.70000000 0.00000000 0.00000000) // 0
	(0.00000000 0.00000000 0.00000000) // 1
	(0.30716179 0.09183199 0.00000000) // 2
	(0.30000000 10.00000000 0.00000000) // 3
	(-9.70000000 0.00000000 0.01000000) // 4
	(0.00000000 0.00000000 0.01000000) // 5
	(0.30716179 0.09183199 0.01000000) // 6
	(0.30000000 10.00000000 0.01000000) // 7
	(0.30000000 -10.00000000 0.00000000) // 8
	(0.30066191 -0.02434082 0.00000000) // 9
	(0.30000000 -10.00000000 0.01000000) // 10
	(0.30066191 -0.02434082 0.01000000) // 11
	(0.99991827 0.00088256 0.00000000) // 12
	(0.99800000 10.00000000 0.00000000) // 13
	(0.99991827 0.00088256 0.01000000) // 14
	(0.99800000 10.00000000 0.01000000) // 15
	(0.99800000 -10.00000000 0.00000000) // 16
	(0.99974397 -0.00111748 0.00000000) // 17
	(0.99800000 -10.00000000 0.01000000) // 18
	(0.99974397 -0.00111748 0.01000000) // 19
	(10.99800000 0.00088256 0.00000000) // 20
	(10.99800000 10.00000000 0.00000000) // 21
	(10.99800000 0.00088256 0.01000000) // 22
	(10.99800000 10.00000000 0.01000000) // 23
	(10.99800000 -10.00000000 0.00000000) // 24
	(10.99800000 -0.00111748 0.00000000) // 25
	(10.99800000 -10.00000000 0.01000000) // 26
	(10.99800000 -0.00111748 0.01000000) // 27
);

blocks
(
	hex ( 0 1 2 3 4 5 6 7 )  ( 62 60 1 ) simpleGrading ( 0.000994719466547771 1 1 ) // 0 
	hex ( 0 8 9 1 4 10 11 5 )  ( 60 62 1 ) simpleGrading ( 1 0.000994719466547771 1 ) // 1 
	hex ( 2 12 13 3 6 14 15 7 )  ( 65 62 1 ) edgeGrading ( 4.0 4.0 4.0 4.0 1005.308565509988 1005.3085655099893 1005.3085655099893 1005.308565509988 1 1 1 1 ) // 2 
	hex ( 9 8 16 17 11 10 18 19 )  ( 62 65 1 ) edgeGrading ( 1005.308565509988 1005.3085655099893 1005.3085655099893 1005.308565509988 4.0 4.0 4.0 4.0 1 1 1 1 ) // 3 
	hex ( 12 20 21 13 14 22 23 15 )  ( 67 62 1 ) simpleGrading ( 25.031895587138223 1005.3085655099893 1 ) // 4 
	hex ( 17 16 24 25 19 18 26 27 )  ( 62 67 1 ) simpleGrading ( 1005.3085655099893 25.031895587138223 1 ) // 5 
	hex ( 12 17 25 20 14 19 27 22 )  ( 3 67 1 ) simpleGrading ( 1 25.031895587138223 1 ) // 6 
);

edges
(
	arc 0 3 (-6.77106781 7.07106781 0.00000000) // arc 0 3 origin 1 (0.30000000 0.00000000 0.00000000)
...
	arc 4 7 (-6.77106781 7.07106781 0.01000000) // arc 4 7 origin 1 (0.30000000 0.00000000 0.01000000)
...
	arc 0 8 (-6.77106781 -7.07106781 0.00000000) // arc 0 8 origin 1 (0.30000000 0.00000000 0.00000000)
...
	arc 4 10 (-6.77106781 -7.07106781 0.01000000) // arc 4 10 origin 1 (0.30000000 0.00000000 0.01000000)
...
...
...
...
...
);

boundary
(
	symmetry1
	{
		type symmetry;
		faces
		(
			(17 16 24 25)
			(12 17 25 20)
			(2 12 13 3)
			(0 1 2 3)
			(9 8 16 17)
			(12 20 21 13)
			(0 8 9 1)
		);
	}

	symmetry2
	{
		type symmetry;
		faces
		(
			(6 14 15 7)
			(11 10 18 19)
			(14 22 23 15)
			(4 10 11 5)
			(14 19 27 22)
			(19 18 26 27)
			(4 5 6 7)
		);
	}

	wing
	{
		type wall;
		faces
		(
			(6 14 12 2)
			(5 11 9 1)
			(11 9 17 19)
			(5 1 2 6)
			(14 19 17 12)
		);
	}

	inout
	{
		type patch;
		faces
		(
			(7 15 13 3)
			(4 0 3 7)
			(4 10 8 0)
			(18 16 24 26)
			(27 26 24 25)
			(22 27 25 20)
			(15 23 21 13)
			(22 20 21 23)
			(10 8 16 18)
		);
	}

);

faces
(
);

mergePatchPairs
(
);

scale 1;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Created with classy_blocks: https://github.com/damogranlabs/classy_blocks //
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
