results/case_lale_20260806_084558/config/0_orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Verbatim from canonical DAFoam NACA0012 incompressible tutorial.
// Kinematic pressure (p / rho) in DASimpleFoam. Reference value is
// arbitrary; only gradients matter.

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(wing.*)"
    {
        type            zeroGradient;
    }

    inout
    {
        type            fixedValue;
        value           $internalField;
    }

    symmetry1
    {
        type            symmetry;
    }

    symmetry2
    {
        type            symmetry;
    }
}


// ************************************************************************* //
