results/case_lale_20260806_084558/config/0_orig/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Verbatim from canonical DAFoam NACA0012 incompressible tutorial.
// SA transport variable, freestream seed ~ 3*nu = 4.5e-5.
// Wall BC is fixedValue 0 regardless of wall-function status (SA does not
// use a separate wall function for the transported variable).

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 4.5e-05;

boundaryField
{
    "(wing.*)"
    {
        type            fixedValue;
        value           uniform 0.0;
    }

    inout
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    symmetry1
    {
        type            symmetry;
    }

    symmetry2
    {
        type            symmetry;
    }
}


// ************************************************************************* //
