results/case_lale_20260806_084558/config/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Verbatim copy from DAFoam's own passing regression test case:
// dafoam/tests/reg_test_files-main/NACA0012V4/system.incompressible
// (exercised by runRegTests_AeroOpt.py: DASimpleFoam + SA + wall functions
// + FFD + adjoint -- our exact chain).
//
// Three deliberate departures from our previous "robust primal" setup:
//
//   1. consistent = false (plain SIMPLE, not SIMPLEC). SIMPLEC restructures
//      the pressure equation; DAFoam's residual formulation and its
//      linearization assume the plain SIMPLE form.
//
//   2. nNonOrthogonalCorrectors = 0. With correctors > 0 the pressure
//      equation is solved multiple times per outer iteration, so the
//      residual DAFoam linearizes no longer matches the single-pass
//      residual it assembles the Jacobian from.
//
//   3. residualControl entries are 1e-20, i.e. effectively disabled. This
//      prevents OpenFOAM's own SIMPLE loop from declaring convergence and
//      exiting early behind DAFoam's back; DAFoam owns the stopping logic
//      via primalMinResTol / primalFuncStdTol.
//
// Note the linear solvers use loose relTol (0.1) with a hard maxIter cap
// (10) and tolerance 1e-20 -- cheap, capped inner solves, with outer SIMPLE
// iterations doing the convergence work. No pRefCell is needed because p
// has a fixedValue Dirichlet BC at the inout patch.

SIMPLE
{
    consistent                         false;
    nNonOrthogonalCorrectors           0;
    residualControl
    {
        U                              1.000000e-20;
        nuTilda                        1.000000e-20;
        p                              1.000000e-20;
        e                              1.000000e-20;
        h                              1.000000e-20;
        p_rgh                          1.000000e-20;
        k                              1.000000e-20;
        omega                          1.000000e-20;
        epsilon                        1.000000e-20;
        T                              1.000000e-20;
        rho                            1.000000e-20;
    }
}

solvers
{
    "(p|p_rgh|G)Final"
    {
        relTol                         0;
        nPreSweeps                     0;
        nCellsInCoarsestLevel          10;
        agglomerator                   faceAreaPair;
        maxIter                        500;
        solver                         GAMG;
        tolerance                      1e-06;
        smoother                       GaussSeidel;
        cacheAgglomeration             true;
        mergeLevels                    1;
        nPostSweeps                    2;
    }
    Phi
    {
        relTol                         1e-2;
        maxIter                        50;
        agglomerator                   faceAreaPair;
        nCellsInCoarsestLevel          10;
        solver                         GAMG;
        cacheAgglomeration             true;
        mergeLevels                    1;
        smoother                       DIC;
        tolerance                      1e-6;
    }
    "(U|T|e|h|nuTilda|k|omega|epsilon|ReThetat|gammaInt)Final"
    {
        relTol                         0;
        nSweeps                        1;
        solver                         smoothSolver;
        smoother                       GaussSeidel;
        maxIter                        500;
        tolerance                      1e-06;
    }
    "(U|T|e|h|nuTilda|k|omega|epsilon|ReThetat|gammaInt)"
    {
        relTol                         0.1;
        nSweeps                        1;
        solver                         smoothSolver;
        smoother                       GaussSeidel;
        maxIter                        10;
        tolerance                      1e-20;
    }
    "(p|p_rgh|G)"
    {
        relTol                         0.1;
        nPreSweeps                     0;
        nCellsInCoarsestLevel          10;
        agglomerator                   faceAreaPair;
        maxIter                        10;
        solver                         GAMG;
        tolerance                      1e-20;
        smoother                       GaussSeidel;
        cacheAgglomeration             true;
        mergeLevels                    1;
        nPostSweeps                    2;
    }
}

relaxationFactors
{
    fields
    {
        p                              0.30;
    }
    equations
    {
        U                              0.70;
        T                              0.70;
        nuTilda                        0.70;
        k                              0.70;
        omega                          0.70;
        epsilon                        0.70;
        gammaInt                       0.70;
        ReThetat                       0.70;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors           20;
    PhiRefCell                         0;
    PhiRefValue                        0;
}


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
